%目标到点的夹角（角度）
function d = derec(A,B)

d0 = atan2((B(:,2)-A(:,2)),(B(:,1)-A(:,1)));
d = 180*d0/pi;
%     if (B(:,1)-A(:,1))~=0
%         d0 = (B(:,2)-A(:,2))/(B(:,1)-A(:,1));
%         if B(:,2)-A(:,2)>=0 && B(:,1)-A(:,1)>0
%             d = 180*atan(d0)/pi;
%         elseif B(:,2)-A(:,2)>=0 && B(:,1)-A(:,1)<0
%             d = 180*atan(d0)/pi+180;
%         elseif B(:,2)-A(:,2)<0 && B(:,1)-A(:,1)<0
%             d = 180*atan(d0)/pi-180;
%         elseif B(:,2)-A(:,2)<0 && B(:,1)-A(:,1)>0
%             d = 180*atan(d0)/pi;
%         end
%     elseif B(:,2)-A(:,2)>=0
%         d = 90;
%     else
%         d = -90;
%     end
